---
kind: method
id: M:Autodesk.Revit.DB.CategorySetIterator.#ctor
source: html/a7ed1d75-baf6-0160-ca93-1ff4286d416b.htm
---
# Autodesk.Revit.DB.CategorySetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public CategorySetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.